# -*- mode: ruby -*-

tap 'caskroom/cask'

brew 'git'
brew 'gnutls'
brew 'emacs', args: ['with-cocoa', 'with-gnutls']
brew 'coreutils'
brew 'findutils'
brew 'bash'
brew 'tmux'
brew 'ack'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'python'
brew 'pyenv'
brew 'bash-completion'
brew 'chruby'
brew 'ruby-install'
brew 'leiningen'
brew 'postgres'
brew 'tree'
brew 'redis'
brew 'aspell', args: ['with-lang-en', 'with-lang-pl']
brew 'htop-osx'
brew 'tarsnap'
brew 'go'
brew 'dnsmasq'
brew 'zsh'
brew 'libyaml'
brew 'fasd'
brew 'gawk'
brew 'elixir'
brew 'libffi'
brew 'watchman'
brew 'ffmpeg'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']

cask 'iterm2'
cask 'google-chrome'
cask 'ukelele'
cask 'dropbox'
cask 'firefox'
cask 'virtualbox'
cask 'intellij-idea'
cask 'vagrant'
cask 'java'
cask 'gpgtools'
cask 'skype'
cask 'mou'
cask 'alfred'
cask 'google-hangouts'
cask 'viscosity'
cask 'dash'
cask 'ngrok'
cask 'imageoptim'
cask 'appcleaner'
cask 'textual'
cask 'visual-studio-code'
