tap "1password/tap"
tap "ariga/tap"
tap "authzed/tap"
tap "candid82/brew"
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "yqrashawn/goku"
brew "xz"
brew "little-cms2"
brew "aspell"
brew "bat"
brew "caddy"
brew "cloud-sql-proxy"
brew "cmake"
brew "cmctl"
brew "colima"
brew "coreutils"
brew "curl"
brew "d2"
brew "dasel"
brew "direnv"
brew "dnsmasq"
brew "docker-credential-helper"
brew "dog"
brew "duckdb"
brew "enchant"
brew "expat"
brew "fd"
brew "findutils"
brew "node"
brew "firebase-cli"
brew "flyctl"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gcc@11"
brew "geos"
brew "git"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "harfbuzz"
brew "hasura-cli"
brew "imagemagick"
brew "jansson"
brew "jpeg"
brew "jq"
brew "just"
brew "libgccjit"
brew "libiconv"
brew "librsync"
brew "libyaml"
brew "mailutils"
brew "make"
brew "protobuf"
brew "mosh"
brew "ncdu"
brew "nmap"
brew "openblas"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "postgresql@15", link: true
brew "prettier"
brew "proj"
brew "python@3.10"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "rust-analyzer"
brew "rye"
brew "shellcheck"
brew "starship"
brew "terraform"
brew "texinfo"
brew "tree"
brew "tree-sitter"
brew "typescript"
brew "typescript-language-server"
brew "wget"
brew "xh"
brew "xsv"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "ariga/tap/atlas"
brew "authzed/tap/zed"
brew "cloudflare/cloudflare/cloudflared", link: false
brew "yqrashawn/goku/goku"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "font-iosevka-slab"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "insomnia"
cask "karabiner-elements"
cask "kitty", args: { appdir: "~/Applications" }
cask "notion", args: { appdir: "~/Applications" }
cask "notion-calendar", args: { appdir: "~/Applications" }
cask "spotify"
vscode "bierner.lit-html"
vscode "bradymholt.pgformatter"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "tuttieee.emacs-mcx"
