# -*- mode: ruby -*-

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "twilio/brew"

brew "aspell"
brew "autoconf"
brew "bash"
brew "bash-completion"
brew "bat"
brew "chruby"
brew "cocoapods"
brew "coreutils"
brew "direnv"
brew "dnsmasq"
brew "doctl"
brew "jpeg"
brew "wxmac"
brew "erlang"
brew "elixir"
brew "fd"
brew "findutils"
brew "fzf"
brew "gmp"
brew "readline"
brew "gawk"
brew "gdbm"
brew "git"
brew "just"
brew "libffi"
brew "pcre"
brew "xz"
brew "glib"
brew "ledger"
brew "libunistring"
brew "pkg-config"
brew "gnupg"
brew "go"
brew "goku"
brew "hasura-cli"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libyaml"
brew "memcached"
brew "ncdu"
brew "node"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "postgresql"
brew "postgrest"
brew "prettier"
brew "proselint"
brew "pyenv"
brew "rabbitmq"
brew "redis"
brew "ripgrep"
brew "ruby-install"
brew "rust-analyzer"
brew "starship"
brew "tarsnap"
brew "tmux"
brew "tree"
brew "typescript"
brew "wget"
brew "yarn"
brew "xsv"
brew "zoxide"
brew "zsh"
brew "twilio/brew/twilio"
brew "git-delta"
brew "xh"

cask "1password"
cask "adoptopenjdk"
cask "adoptopenjdk8"
cask "alfred"
cask "android-studio"
cask "anki"
cask "appcleaner"
cask "arq"
cask "dash"
cask "docker"
cask "dropbox"
cask "emacs"
cask "firefox"
cask "focus"
cask "fontforge"
cask "google-chrome"
cask "google-cloud-sdk"
cask "imageoptim"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "krisp"
cask "mullvadvpn"
cask "ngrok"
cask "pixelsnap"
cask "reactotron"
cask "sketch"
cask "spotify"
cask "textual"
cask "ukelele"
cask "viscosity"
cask "visual-studio-code"
cask "zoom"
